{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "Input_layer",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            36,
            60,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "Input_layer"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "filters": 20,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "Input_layer",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_1",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_1",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "filters": 50,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_2",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_1",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_1",
          "trainable": true,
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_1",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "units": 500,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "flatten_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            2
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "concatenate_1",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_1",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ],
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_2",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "units": 2,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_1",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "Input_layer",
        0,
        0
      ],
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_2",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.4",
  "backend": "tensorflow"
}