__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_layer (InputLayer)        (None, 36, 60, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 56, 20)   520         Input_layer[0][0]                
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 16, 28, 20)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 12, 24, 50)   25050       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 6, 12, 50)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3600)         0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 500)          1800500     flatten_1[0][0]                  
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 2)            0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 502)          0           dense_1[0][0]                    
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            1006        concatenate_1[0][0]              
==================================================================================================
Total params: 1,827,076
Trainable params: 1,827,076
Non-trainable params: 0
__________________________________________________________________________________________________
